In [2]:
import pandas as pd
import pandas_profiling
import numpy as np
import seaborn as sns
import os
import matplotlib.pyplot as plt
pd.options.display.max_rows=150
%matplotlib inline

In [3]:
d_orig = pd.read_csv('./data/kaggle_01/train.csv')
d = d_orig.copy()
print(d.shape); d.head(2)

(26049, 16)

,id,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,0,40,Private,168538,HS-grad,9,Married-civ-spouse,Sales,Husband,White,Male,0,0,60,United-States,>50K
1,1,17,Private,101626,9th,5,Never-married,Machine-op-inspct,Own-child,White,Male,0,0,20,United-States,<=50K

In [4]:
d_test = pd.read_csv('./data/kaggle_01/test.csv')
d_t = d_test.copy()
print(d_t.shape); d_t.head(2)

(6512, 15)

,id,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country
0,0,28,Private,67661,Some-college,10,Never-married,Adm-clerical,Other-relative,White,Female,0,0,40,United-States
1,1,40,Self-emp-inc,37869,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,50,United-States

In [5]:
# profile = d.profile_report()
# profile

In [6]:
d = d.drop('education', axis=1)

In [7]:
d['is_income_over_50K'] = d['income']=='>50K'

In [8]:
d['fnlwgt'].head(10)

0    168538
1    101626
2    353358
3    151158
4    122234
5    236985
6    206139
7    340599
8    230136
9    153031
Name: fnlwgt, dtype: int64

In [9]:
d['fnlwgt'].describe()

count    2.604900e+04
mean     1.903045e+05
std      1.059663e+05
min      1.376900e+04
25%      1.181080e+05
50%      1.788660e+05
75%      2.377350e+05
max      1.484705e+06
Name: fnlwgt, dtype: float64